W8D1/reddit_clone/app/views/posts/show.html.erb

<br>
<% top_level = @post.comments.where(parent_comment_id: nil) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."parent_comment_id" IS NULL  [["post_id", 1]]