W8D1/reddit_clone/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."parent_comment_id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "this is a reply"], ["author_id", 6], ["post_id", 1], ["created_at", "2019-10-07 23:37:02.238343"], ["updated_at", "2019-10-07 23:37:02.238343"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    # @comment.post_id = params[:post_id]
    # @comment.parent_comment_id = params[:parent_comment_id]

    @prev_comment = Comment.find_by(parent_comment_id: params[:parent_comment_id])
    @comment.post_id = @prev_comment.post_id
    @comment.parent_comment_id = @prev_comment.id

    # if @comment.post_id.nil?
    #   @comment.post_id = params[:post_id]
    # else
    #   @comment.comment_id = params[:comment_id]
    #   @prev_comment = Comment.find_by(id: params[:id])
    #   @comment.post_id = @prev_comment.post_id
    # end

    if @comment.save