W8D1/reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Friend"], ["description", "Hello Friend"], ["moderator_id", 6], ["created_at", "2019-10-07 18:44:35.185888"], ["updated_at", "2019-10-07 18:44:35.185888"]]