W10D5/to_do/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todos_params)
    if @todo.save
---
INSERT INTO "todos" ("id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 6], ["title", "wash car"], ["body", "with soap"], ["created_at", "2019-10-25 22:07:14.956479"], ["updated_at", "2019-10-25 22:07:14.956479"]]

  def update
    @todo = Todo.find(params[:id])

    if @todo
      @todo.update(todos_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "UPDATE"], ["body", "UPDATE"], ["updated_at", "2019-10-25 22:37:24.293653"], ["id", 2]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.delete
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]