W6D3/art-share-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chris"], ["email", "chris@aa.io"], ["created_at", "2019-09-25 22:28:47.463158"], ["updated_at", "2019-09-25 22:28:47.463158"]]
---
  def create
    user = User.new(params.require(:user).permit(:name, :email))
    # replace the `user_attributes_here` with the actual attribute keys
    user.save!