W8D1/reddit_clone/app/views/users/show.html.erb

SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = ?  [["user_id", 3]]
---

<% @user.subs.each do |sub| %>