W7D2/music_app/app/models/user.rb

  def reset_session_token!
    self.update!(session_token:SecureRandom.urlsafe_base64)
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "gVcgR3fGNftBSMObcWaR1g"], ["updated_at", "2019-10-01 21:52:44.339259"], ["id", 2]]