W8D1/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "qsy_Tecovr0zAWDXUCXu5w"], ["updated_at", "2019-10-07 18:42:21.238334"], ["id", 6]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!