W7D3/Capivara/app/controllers/users_controller.rb

  def show
    @users = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]