W7D2/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asf"], ["created_at", "2019-10-01 22:39:45.105136"], ["updated_at", "2019-10-01 22:39:45.105136"]]
---
  def create
    @band = Band.new(band_params)
    if @band.save