W7D2/music_app/app/controllers/users_controller.rb

  def show
    if logged_in?
      @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test1creation"], ["session_token", "aKjLO_ZU1CKUh2KPnaBDeA"], ["created_at", "2019-10-01 23:11:19.481679"], ["updated_at", "2019-10-01 23:11:19.481679"]]