W6D5/cats_99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cats_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"