W6D3-W6D4/art-share-api/app/controllers/artworkshares_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def delete
    shared = User.find(artwork_share_params[:id])