W6D3-W6D4/art-share-api/app/controllers/comments_controller.rb

  def index
    if params.has_key?(:author_id)
      comments = Comment.where(author_id: params[:author_id])
    elsif params.has_key?(:art_id)
      comments = Comment.where(art_id: params[:art_id])
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments"