W6D3-W6D4/art-share-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    # users = User.all
    # render json: users
    if params.has_key?(:id)
      user = User.find(user_params[:id])
      render json: user
    else
      users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chris"], ["email", "chris@aa.io"], ["created_at", "2019-09-25 22:28:47.463158"], ["updated_at", "2019-09-25 22:28:47.463158"]]
---
  def create
    user = User.new(user_params)

    # user.save!
    # render json: user
    if user.save #truthy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def update
    user = User.find(params(:id))