W8D1/reddit_clone/app/views/comments/show.html.erb

<br>
<% replies = Comment.where('parent_comment_id = @comment.parent_comment_id') %>
---
SELECT "comments".* FROM "comments" WHERE (parent_comment_id = @comment.parent_comment_id)